#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.eks.module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0c0d37e285b2e30e8]
module.eks.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06d11b094195ee833]
module.eks.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/MyFirstCluster/cluster]
module.eks.module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0d0dd7f3f6fcf2c45]
module.eks.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0cedbbbf35ebc71a8]
module.eks.module.eks.aws_iam_role.this[0]: Refreshing state... [id=MyFirstCluster-cluster-20220117055121020100000002]
module.eks.module.eks.module.eks_managed_node_group["spot"].aws_iam_role.this[0]: Refreshing state... [id=spot-eks-node-group-20220117055121017800000001]
module.eks.module.eks.module.eks_managed_node_group["spot"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=spot-eks-node-group-20220117055121017800000001-20220117055122071000000005]
module.eks.module.eks.module.eks_managed_node_group["spot"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=spot-eks-node-group-20220117055121017800000001-20220117055122114000000007]
module.eks.module.eks.module.eks_managed_node_group["spot"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=spot-eks-node-group-20220117055121017800000001-20220117055122065700000003]
module.eks.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=MyFirstCluster-cluster-20220117055121020100000002-20220117055122073600000006]
module.eks.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=MyFirstCluster-cluster-20220117055121020100000002-20220117055122068500000004]
module.eks.module.eks.module.eks_managed_node_group["spot"].aws_security_group.this[0]: Refreshing state... [id=sg-0a3edf5405d91dd7b]
module.eks.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-051176f2cddb84e13]
module.eks.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0dd6e6c03417f4c78]
module.eks.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0e22b19d9b21147d8]
module.eks.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-09ddaf06f54d01596]
module.eks.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-065cb3e1794859122]
module.eks.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04873d07ef84378b2]
module.eks.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0021ced74154d7b5e]
module.eks.module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-09ab742ac3ae2d83c]
module.eks.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-08fbf14dc963d5385]
module.eks.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-04c063de838c4fc27]
module.eks.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-050d5b6ed10257190]
module.eks.module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-2380935992]
module.eks.module.eks.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-1105172107]
module.eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-2935833146]
module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-3600857117]
module.eks.module.eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-573908827]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2188698015]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3070626661]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-324642954]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1581860539]
module.eks.module.eks.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-3642080481]
module.eks.module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-4260043333]
module.eks.module.eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-1554711126]
module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1489451643]
module.eks.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0dd6e6c03417f4c781080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.module.eks.aws_cloudwatch_log_group.this[0] has changed
  ~ resource "aws_cloudwatch_log_group" "this" {
        id                = "/aws/eks/MyFirstCluster/cluster"
        name              = "/aws/eks/MyFirstCluster/cluster"
      + tags              = {}
        # (3 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_iam_role.this[0] has changed
  ~ resource "aws_iam_role" "this" {
        id                    = "MyFirstCluster-cluster-20220117055121020100000002"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          + "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ]
        name                  = "MyFirstCluster-cluster-20220117055121020100000002"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_security_group.cluster[0] has changed
  ~ resource "aws_security_group" "cluster" {
      ~ egress                 = [
          + {
              + cidr_blocks      = []
              + description      = "Cluster API to node groups"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-09ddaf06f54d01596",
                ]
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "Cluster API to node kubelets"
              + from_port        = 10250
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-09ddaf06f54d01596",
                ]
              + self             = false
              + to_port          = 10250
            },
        ]
        id                     = "sg-065cb3e1794859122"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Node groups to cluster API"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-09ddaf06f54d01596",
                ]
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "MyFirstCluster-cluster-2022011705512909400000000a"
        tags                   = {
            "Name" = "MyFirstCluster-cluster"
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group.node[0] has changed
  ~ resource "aws_security_group" "node" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Egress NTP/TCP to internet"
              + from_port        = 123
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 123
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Egress NTP/UDP to internet"
              + from_port        = 123
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 123
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Egress all HTTPS to internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "Node groups to cluster API"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-065cb3e1794859122",
                ]
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "Node to node CoreDNS"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 53
            },
          + {
              + cidr_blocks      = []
              + description      = "Node to node CoreDNS"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = true
              + to_port          = 53
            },
        ]
        id                     = "sg-09ddaf06f54d01596"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Cluster API to node groups"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-065cb3e1794859122",
                ]
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "Cluster API to node kubelets"
              + from_port        = 10250
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-065cb3e1794859122",
                ]
              + self             = false
              + to_port          = 10250
            },
          + {
              + cidr_blocks      = []
              + description      = "Node to node CoreDNS"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 53
            },
          + {
              + cidr_blocks      = []
              + description      = "Node to node CoreDNS"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = true
              + to_port          = 53
            },
        ]
        name                   = "MyFirstCluster-node-20220117055129090400000009"
        tags                   = {
            "Name"                                 = "MyFirstCluster-node"
            "kubernetes.io/cluster/MyFirstCluster" = "owned"
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.cluster["egress_nodes_443"] has changed
  ~ resource "aws_security_group_rule" "cluster" {
      + cidr_blocks              = []
        id                       = "sgrule-1105172107"
      + ipv6_cidr_blocks         = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"] has changed
  ~ resource "aws_security_group_rule" "cluster" {
      + cidr_blocks              = []
        id                       = "sgrule-2380935992"
      + ipv6_cidr_blocks         = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] has changed
  ~ resource "aws_security_group_rule" "cluster" {
      + cidr_blocks              = []
        id                       = "sgrule-2935833146"
      + ipv6_cidr_blocks         = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_cluster_443"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-3642080481"
      + ipv6_cidr_blocks         = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_https"] has changed
  ~ resource "aws_security_group_rule" "node" {
        id                = "sgrule-4260043333"
      + ipv6_cidr_blocks  = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_ntp_tcp"] has changed
  ~ resource "aws_security_group_rule" "node" {
        id                = "sgrule-573908827"
      + ipv6_cidr_blocks  = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_ntp_udp"] has changed
  ~ resource "aws_security_group_rule" "node" {
        id                = "sgrule-1554711126"
      + ipv6_cidr_blocks  = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-1489451643"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-09ddaf06f54d01596"
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_udp"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-3600857117"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-09ddaf06f54d01596"
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_443"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-1581860539"
      + ipv6_cidr_blocks         = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-2188698015"
      + ipv6_cidr_blocks         = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-324642954"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-09ddaf06f54d01596"
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-3070626661"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-09ddaf06f54d01596"
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0dd6e6c03417f4c78"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-04873d07ef84378b2"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "MyFirstCluster-vpc-public"
        }
        # (5 unchanged attributes hidden)
    }

  # module.eks.module.eks.module.eks_managed_node_group["spot"].aws_iam_role.this[0] has changed
  ~ resource "aws_iam_role" "this" {
        id                    = "spot-eks-node-group-20220117055121017800000001"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          + "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          + "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ]
        name                  = "spot-eks-node-group-20220117055121017800000001"
      + tags                  = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.eks.module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "MyFirstCluster"
      + platform_version          = (known after apply)
      + role_arn                  = "arn:aws:iam::865518846931:role/MyFirstCluster-cluster-20220117055121020100000002"
      + status                    = (known after apply)
      + tags_all                  = (known after apply)
      + version                   = (known after apply)

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = [
              + "sg-065cb3e1794859122",
            ]
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.module.vpc.aws_eip.nat[1] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0d0dd7f3f6fcf2c45"
      ~ tags                 = {
          ~ "Name" = "MyFirstCluster-vpc-ap-northeast-1b" -> "MyFirstCluster-vpc-ap-northeast-1c"
        }
      ~ tags_all             = {
          ~ "Name" = "MyFirstCluster-vpc-ap-northeast-1b" -> "MyFirstCluster-vpc-ap-northeast-1c"
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.module.vpc.aws_eip.nat[2] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0c0d37e285b2e30e8"
      ~ tags                 = {
          ~ "Name" = "MyFirstCluster-vpc-ap-northeast-1c" -> "MyFirstCluster-vpc-ap-northeast-1d"
        }
      ~ tags_all             = {
          ~ "Name" = "MyFirstCluster-vpc-ap-northeast-1c" -> "MyFirstCluster-vpc-ap-northeast-1d"
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = "eipalloc-0cedbbbf35ebc71a8"
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-051176f2cddb84e13"
      + tags                 = {
          + "Name" = "MyFirstCluster-vpc-ap-northeast-1a"
        }
      + tags_all             = {
          + "Name" = "MyFirstCluster-vpc-ap-northeast-1a"
        }
    }

  # module.eks.module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = "eipalloc-0d0dd7f3f6fcf2c45"
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "MyFirstCluster-vpc-ap-northeast-1c"
        }
      + tags_all             = {
          + "Name" = "MyFirstCluster-vpc-ap-northeast-1c"
        }
    }

  # module.eks.module.vpc.aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = "eipalloc-0c0d37e285b2e30e8"
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "MyFirstCluster-vpc-ap-northeast-1d"
        }
      + tags_all             = {
          + "Name" = "MyFirstCluster-vpc-ap-northeast-1d"
        }
    }

  # module.eks.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0021ced74154d7b5e"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.eks.module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-08fbf14dc963d5385"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.eks.module.vpc.aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-09ab742ac3ae2d83c"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.eks.module.vpc.aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-08fbf14dc963d5385"
      ~ tags             = {
          ~ "Name" = "MyFirstCluster-vpc-private-ap-northeast-1b" -> "MyFirstCluster-vpc-private-ap-northeast-1c"
        }
      ~ tags_all         = {
          ~ "Name" = "MyFirstCluster-vpc-private-ap-northeast-1b" -> "MyFirstCluster-vpc-private-ap-northeast-1c"
        }
        # (5 unchanged attributes hidden)
    }

  # module.eks.module.vpc.aws_route_table.private[2] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-09ab742ac3ae2d83c"
      ~ tags             = {
          ~ "Name" = "MyFirstCluster-vpc-private-ap-northeast-1c" -> "MyFirstCluster-vpc-private-ap-northeast-1d"
        }
      ~ tags_all         = {
          ~ "Name" = "MyFirstCluster-vpc-private-ap-northeast-1c" -> "MyFirstCluster-vpc-private-ap-northeast-1d"
        }
        # (5 unchanged attributes hidden)
    }

  # module.eks.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-0021ced74154d7b5e"
      + subnet_id      = "subnet-050d5b6ed10257190"
    }

  # module.eks.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-08fbf14dc963d5385"
      + subnet_id      = (known after apply)
    }

  # module.eks.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-09ab742ac3ae2d83c"
      + subnet_id      = (known after apply)
    }

  # module.eks.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0dd6e6c03417f4c78"
      + subnet_id      = "subnet-051176f2cddb84e13"
    }

  # module.eks.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0dd6e6c03417f4c78"
      + subnet_id      = (known after apply)
    }

  # module.eks.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0dd6e6c03417f4c78"
      + subnet_id      = (known after apply)
    }

  # module.eks.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "MyFirstCluster-vpc-private-ap-northeast-1c"
        }
      + tags_all                                       = {
          + "Name" = "MyFirstCluster-vpc-private-ap-northeast-1c"
        }
      + vpc_id                                         = "vpc-06d11b094195ee833"
    }

  # module.eks.module.vpc.aws_subnet.private[2] must be replaced
+/- resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:ap-northeast-1:865518846931:subnet/subnet-04c063de838c4fc27" -> (known after apply)
      ~ availability_zone                              = "ap-northeast-1c" -> "ap-northeast-1d" # forces replacement
      ~ availability_zone_id                           = "apne1-az1" -> (known after apply)
      ~ id                                             = "subnet-04c063de838c4fc27" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "865518846931" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name" = "MyFirstCluster-vpc-private-ap-northeast-1c" -> "MyFirstCluster-vpc-private-ap-northeast-1d"
        }
      ~ tags_all                                       = {
          ~ "Name" = "MyFirstCluster-vpc-private-ap-northeast-1c" -> "MyFirstCluster-vpc-private-ap-northeast-1d"
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                 = "MyFirstCluster-vpc-public-ap-northeast-1c"
          + "kubernetes.io/cluster/MyFirstCluster" = "shared"
          + "kubernetes.io/role/elb"               = "1"
        }
      + tags_all                                       = {
          + "Name"                                 = "MyFirstCluster-vpc-public-ap-northeast-1c"
          + "kubernetes.io/cluster/MyFirstCluster" = "shared"
          + "kubernetes.io/role/elb"               = "1"
        }
      + vpc_id                                         = "vpc-06d11b094195ee833"
    }

  # module.eks.module.vpc.aws_subnet.public[2] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:ap-northeast-1:865518846931:subnet/subnet-0e22b19d9b21147d8" -> (known after apply)
      ~ availability_zone                              = "ap-northeast-1c" -> "ap-northeast-1d" # forces replacement
      ~ availability_zone_id                           = "apne1-az1" -> (known after apply)
      ~ id                                             = "subnet-0e22b19d9b21147d8" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "865518846931" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name"                                 = "MyFirstCluster-vpc-public-ap-northeast-1c" -> "MyFirstCluster-vpc-public-ap-northeast-1d"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          ~ "Name"                                 = "MyFirstCluster-vpc-public-ap-northeast-1c" -> "MyFirstCluster-vpc-public-ap-northeast-1d"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.module.eks_managed_node_group["spot"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "MyFirstCluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "r5.large",
          + "r5n.large",
          + "r4.large",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "spot-"
      + node_role_arn          = "arn:aws:iam::865518846931:role/spot-eks-node-group-20220117055121017800000001"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name" = "spot"
        }
      + tags_all               = {
          + "Name" = "spot"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # module.eks.module.eks.module.eks_managed_node_group["spot"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for spot EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "spot-"
      + tags_all               = (known after apply)
      + update_default_version = true
      + vpc_security_group_ids = [
          + "sg-09ddaf06f54d01596",
          + "sg-0a3edf5405d91dd7b",
        ]

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "enabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "spot"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name" = "spot"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name" = "spot"
            }
        }
    }

Plan: 19 to add, 4 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @shogotsuneto, Action: `pull_request`*